Чистая/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>InformationRegister.Скидки</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>НоменклатураНоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Чистая/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Чистая/src/Documents/УстановкаСкидок/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СкидкиТаблица = Скидки.Выгрузить();
	Проверка = СкидкиТаблица[0].НоменклатураНоменклатурнаяГруппа.Наименование;
	Счётчик = Неопределено;
	
	
	Для Счётчик = 1 По (СкидкиТаблица.Количество() - 1) Цикл
		Если Проверка = СкидкиТаблица[Счётчик].НоменклатураНоменклатурнаяГруппа.Наименование Тогда
			
			Сообщить("Найден повтор в списке. Повторяющийся элемент - " + СкидкиТаблица[Счётчик].НоменклатураНоменклатурнаяГруппа.Наименование);
			Отказ = Истина;
			
		Иначе 
			Проверка = СкидкиТаблица[Счётчик].НоменклатураНоменклатурнаяГруппа.Наименование;
		КонецЕсли;
		
	КонецЦикла;

	Движения.Скидки.Записывать = Истина;
	Для Каждого ТекСтрокаСкидки Из Скидки Цикл
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.НоменклатураНоменклатурнаяГруппа = ТекСтрокаСкидки.НоменклатураНоменклатурнаяГруппа;
		Движение.Скидка = ТекСтрокаСкидки.Скидка;
		Движение.Ответственный = Ответственный;
	КонецЦикла;
КонецПроцедуры
